<?php
// // 아래처럼 별을 찍어주세요.
// // 예시)
// // *****
// // *****
// // *****
// // *****
// // *****
for($i = 1; $i <6; $i++) {
    echo "*****"."\n";
}


// // 아래처럼 별을 찍어주세요.
// // 예시)
// // *
// // **
// // ***
// // ****
// // *****

for($multi_star = 1; $multi_star < 2; $multi_star++) {
    echo "*"."\n";
    for($z = 1; $z < 2; $z++) {
        echo "**"."\n";
    }
    for($x = 1; $x < 2; $x++) {
        echo "***"."\n";
    }
    for($y = 1; $y < 2; $y++) {
        echo "****"."\n";
    }
    for($a = 1; $a < 2; $a++) {
        echo "*****"."\n";
    }
}


// // 아래처럼 별을 찍어주세요.
// // 예시)
// //     *
// //    **
// //   ***
// //  ****
// // ***** 

// for($multi_star1 = 1; $multi_star1 < 2; $multi_star1++) {
//     echo "    *"."\n";
//     for($b = 1; $b < 2; $b++) {
//         echo "   **"."\n";
//     }
//     for($c = 1; $c < 2; $c++) {
//         echo "  ***"."\n";
//     }
//     for($d = 1; $d < 2; $d++) {
//         echo " ****"."\n";
//     }
//     for($e = 1; $e < 2; $e++) {
//         echo "*****"."\n";
//     }
// }

for($i=0; $i<=5; $i++){
    for($z=0;$z<=5; $z++){
        if($z<$i){
            echo "*";
        }
    }
    echo "\n";
}
    
    

for($i=0; $i<=5; $i++){
    for($z=5; $z>=0; $z--){
        if($z<$i){
        echo "*";
        }
        else{
        echo " ";
        }
    }
    echo "\n";
}


for($i=1; $i<=5; $i++){
    for($j=0;$j<=10; $j++){
        if($j<=(5-$i) || $j>=(5+$i)){
        echo " ";
        }
        else{
        echo "*";
        }
    }
    echo "\n";
}


for($i=1; $i<=5; $i++){
    for($j=0;$j<=10; $j++){
        if($j<=(5-$i) || $j>=(5+$i)){
        echo " ";
        }
        else{
        echo "*";
        }
    }
    echo "\n";
}




// for($i=1; $i <= 6; $i++) {
//     for($j=1; $j=6-$i; $j++){
//         echo " ";
//     }
//     for($k=1; $k < $i-1; $k++){
//         echo "*";
//     }
//     echo"\n";
// }



echo "\n";

for($j=1; $j<6; $j++){
    for($i=1; $i<$j; $i++){
        echo "*";
    }
    for($i=1; $i<$j; $i++){
        echo "#";
    }

    echo "\n";
}